#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/tech-challenge-fase-3-iac/runs/run-uKUsLMqKvqHiubLk

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
module.db_password_secret.aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr]
module.lanchonete_vpc.aws_vpc.this: Refreshing state... [id=vpc-01ccebb8e1173efa6]
data.aws_iam_role.lab_role: Refreshing...
module.lanchonete_http_api.aws_apigatewayv2_api.this: Refreshing state... [id=yvq96tymqj]
module.nat_gateway.aws_eip.this: Refreshing state... [id=eipalloc-03755bf03705a9775]
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
module.db_password_secret.aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr|terraform-20241215204947233100000002]
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Refreshing state... [id=$default]
module.lanchonete_db_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-066ded97972d280f4]
module.internet_gateway.aws_internet_gateway.this: Refreshing state... [id=igw-071f945585511f03d]
module.lanchonete_eks_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-022c843d74ea0b9d4]
module.public_subnet.aws_subnet.this: Refreshing state... [id=subnet-01ae421ab6a6673f4]
module.lanchonete_db_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-0a18b603050194fdf]
module.lanchonete_private_rt.aws_route_table.this: Refreshing state... [id=rtb-051854c07888f20e3]
module.lanchonete_eks_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-045b7c251df3b06ab]
module.lanchonete_rds_sg.aws_security_group.this: Refreshing state... [id=sg-078fb7125dda17dc5]
module.lanchonete_public_rt.aws_route_table.this: Refreshing state... [id=rtb-05d7da004a7a10e83]
aws_route.lanchonete_public_inet_route: Refreshing state... [id=r-rtb-05d7da004a7a10e831080289494]
aws_route_table_association.lanchonete_private_rta_b: Refreshing state... [id=rtbassoc-0319bd14e97406c47]
aws_route_table_association.lanchonete_public_rta: Refreshing state... [id=rtbassoc-0ec56562bdf958aad]
module.nat_gateway.aws_nat_gateway.this: Refreshing state... [id=nat-0b5272ef821a8f11c]
aws_route_table_association.lanchonete_private_rta_a: Refreshing state... [id=rtbassoc-036f947e599f9a896]
module.lanchonete_rds.aws_db_subnet_group.this: Refreshing state... [id=lanchonete-subnet-group]
module.lanchonete_eks_cluster.aws_eks_cluster.this: Refreshing state... [id=lanchonete-eks-cluster]
aws_route.lanchonete_private_inet_route: Refreshing state... [id=r-rtb-051854c07888f20e31080289494]
module.lanchonete_eks_node_group.aws_eks_node_group.this: Refreshing state... [id=lanchonete-eks-cluster:lanchonete-eks-node-group]
module.lanchonete_rds.aws_db_instance.this: Refreshing state... [id=db-CDPODJYGLX2RS2BVFH3BIF4FPM]
module.lanchonete_public_rt.aws_route_table.this: Drift detected (update)
module.nat_gateway.aws_nat_gateway.this: Drift detected (update)
module.nat_gateway.aws_eip.this: Drift detected (update)
module.lanchonete_eks_node_group.aws_eks_node_group.this: Drift detected (update)
module.lanchonete_private_rt.aws_route_table.this: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lanchonete_eks_node_group.aws_eks_node_group.this has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn             = "arn:aws:eks:us-east-1:721525683170:nodegroup/lanchonete-eks-cluster/lanchonete-eks-node-group/1ec9e6c2-434b-d61d-fb9d-7708a998866d"
        id              = "lanchonete-eks-cluster:lanchonete-eks-node-group"
      + status          = "CREATING"
        tags            = {
            "Provisioner" = "Terraform"
        }
      + version         = "1.31"
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lanchonete_db_private_subnet_a.aws_subnet.this will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-0a18b603050194fdf"
      ~ tags                                           = {
          ~ "Name"        = "lanchonete-private-subnet-a" -> "lanchonete-db-private-subnet-a"
            "Provisioner" = "Terraform"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "lanchonete-private-subnet-a" -> "lanchonete-db-private-subnet-a"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.lanchonete_db_private_subnet_b.aws_subnet.this will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-066ded97972d280f4"
      ~ tags                                           = {
          ~ "Name"        = "lanchonete-private-subnet-b" -> "lanchonete-db-private-subnet-b"
            "Provisioner" = "Terraform"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "lanchonete-private-subnet-b" -> "lanchonete-db-private-subnet-b"
            # (1 unchanged element hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.lanchonete_eks_node_group.aws_eks_node_group.this must be replaced
-/+ resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:721525683170:nodegroup/lanchonete-eks-cluster/lanchonete-eks-node-group/1ec9e6c2-434b-d61d-fb9d-7708a998866d" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ id                     = "lanchonete-eks-cluster:lanchonete-eks-node-group" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.31.3-20241205" -> (known after apply)
      ~ resources              = [] -> (known after apply)
      ~ status                 = "CREATING" -> (known after apply)
        tags                   = {
            "Provisioner" = "Terraform"
        }
      ~ version                = "1.31" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.lanchonete_http_api.aws_apigatewayv2_vpc_link.this will be created
  + resource "aws_apigatewayv2_vpc_link" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "lanchonete-vpc-link"
      + tags_all = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*